/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_calloc.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wrolanda <wrolanda@student.21-school.ru    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/19 16:28:03 by wrolanda          #+#    #+#             */
/*   Updated: 2021/10/19 17:28:43 by wrolanda         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/*Функция calloc выделяет блок памяти для массива 
размером — num элементов, каждый из которых занимает   
size байт, и инициализирует все свои биты в нулями.*/
void	*ft_calloc(size_t count, size_t size)
{
	void	*p;

	p = (void *)malloc(size * count);
	if (p == (void *)0)
		return ((void *)0);
	ft_bzero(p, count * size);
	return (p);
}
